cf/Catalogs/Календари.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Календари</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПроизводственныйКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКалендаря</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКалендарей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипГрафика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.нсиТипыРабочихГрафиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКалендаря</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПериодыДействияГрафика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаИзмененияРасписания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПериодыГрафика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>cfg:EnumRef.нсиДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/Календари/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Календари.Ссылка,Календари.Наименование
		|ИЗ
		|	Справочник.Календари КАК Календари
		|ГДЕ
		|	Календари.Ссылка <> &Ссылка
		|	И Календари.ВладелецКалендаря = &ВладелецКалендаря"
	);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("ВладелецКалендаря",ВладелецКалендаря);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Отказ = Истина;
		ТекстСообщения = "Для данного владельца уже есть календарь """+Выборка.Наименование+"""";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого ПериодыДействия Из ПериодыДействияГрафика Цикл 
		Для Каждого ДеньНедели ИЗ Перечисления.нсиДниНедели Цикл 
			Строки = ПериодыГрафика.НайтиСтроки(новый Структура("ДеньНедели,КлючСтроки",ДеньНедели,ПериодыДействия.КлючСтроки));
			Для АА = 0 ПО Строки.Количество()-1 Цикл 
				Для ББ = АА+1 По Строки.Количество()-1 Цикл 
					Если (Строки[АА].ВремяНачала >= Строки[ББ].ВремяНачала И Строки[АА].ВремяНачала <= Строки[ББ].ВремяОкончания)
						ИЛИ (Строки[АА].ВремяОкончания >= Строки[ББ].ВремяНачала И Строки[АА].ВремяОкончания <= Строки[ББ].ВремяОкончания)
						ИЛИ (Строки[ББ].ВремяНачала >= Строки[АА].ВремяНачала И Строки[ББ].ВремяНачала <= Строки[АА].ВремяОкончания)
						ИЛИ (Строки[ББ].ВремяОкончания >= Строки[АА].ВремяНачала И Строки[ББ].ВремяОкончания <= Строки[АА].ВремяОкончания)
						Тогда
							ТекстСообщения =	"Периоды на дату начала действия "+Формат(ПериодыДействия.ДатаИзмененияРасписания,"ДФ=dd.MM.yyyy") 
												+" на день недели "+Строки[АА].ДеньНедели +" перекрываются!";
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
						КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ВладелецКалендаря = Неопределено;
КонецПроцедуры
